erp3l/src/Catalogs/ВнешниеИнформационныеБазы/ВнешниеИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнешниеИнформационныеБазы</name>
  <predefined>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
  </predefined>
  <attributes>
    <name>URIПространстваИмен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindows</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперацииСФайлами</name>
    <type>
      <types>EnumRef.ВидыОперацийСФайлами</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяWebСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИБНаСервере</name>
    <comment>Имя информационной базы на сервере</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервера</name>
    <comment>Имя сервера 1С: Предприятия</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьWS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаПолногоИмени</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаИмпортаФайлаФорматаФНС</name>
    <type>
      <types>CatalogRef.НастройкиИмпортаФайлаИзФНС</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоИмени</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НСИ_ТребуетСинхронизации</name>
    <comment>(НСИ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольНаСтраницу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКWebСервису</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмещениеВнешнейИБ</name>
    <type>
      <types>EnumRef.ВидыРазмещенияИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>РасширенныйСпособИмпорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаПодключения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипБД</name>
    <type>
      <types>CatalogRef.ТипыБазДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТабличногоДокумента</name>
    <type>
      <types>EnumRef.ТипыВнешнихТабличныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПодключенияWebСервиса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьФайлыПослеИмпорта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайловыйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспортироватьЭлементыНСИ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХранилищаДанныхADO</name>
    <type>
      <types>EnumRef.ТипыХранилищДанныхADO</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляИмпортаЭталонныйКаталог</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭталонныйКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонвертироватьЗначенияВТекст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтруктураИмени</name>
    <attributes>
      <name>НачалоЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Элемент</name>
      <type>
        <types>EnumRef.ТипыОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеЭлемента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Enums/ВидыРазмещенияИБ/ВидыРазмещенияИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРазмещенияИБ</name>
  <enumValues>
    <name>ЛокальнаяВерсия</name>
  </enumValues>
  <enumValues>
    <name>ФайлСерверный</name>
  </enumValues>
  <enumValues>
    <name>КлиентСерверный</name>
  </enumValues>
</mdclass:Enum>

erp3l/src/Catalogs/ТипыБазДанных/ТипыБазДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыБазДанных</name>
  <predefined>
    <items>
      <name>ОбменТаблДок</name>
      <description>Табличные документы (1С или Microsoft Excel)</description>
    </items>
    <items>
      <name>ТекущаяИБ</name>
      <description>Текущая информационная база</description>
    </items>
  </predefined>
  <attributes>
    <name>ВИБПоУмолчанию</name>
    <type>
      <types>CatalogRef.ВнешниеИнформационныеБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>EnumRef.ПлатформыВнешнихИнформационныхБаз</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПоУмолчанию</name>
    <comment>Если при сопоставлении получено пустое значение валюты, тогда подставить значение валюты по умолчанию</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СоответствиеВидовСубконто</name>
    <attributes>
      <name>ВидСубконтоИБ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитики</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыСубконтоКорпоративные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ВнешниеИнформационныеБазы/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(ТипБД) Тогда
		
		Если ТипБД = Справочники.ТипыБазДанных.ОбменТаблДок Тогда
			
			ПроверяемыеРеквизиты.Добавить("ТипТабличногоДокумента");
			ПроверяемыеРеквизиты.Добавить("НачалоИмени");
			
		ИначеЕсли ТипБД = Справочники.ТипыБазДанных.ТекущаяИБ Тогда							
			
			ПроверяемыеРеквизиты.Очистить();
			
		Иначе
			
			Если ТипБД.ВерсияПлатформы = Перечисления.ПлатформыВнешнихИнформационныхБаз.ADO Тогда
				
				ПроверяемыеРеквизиты.Добавить("СтрокаПодключения");
				
			Иначе
			
				Если ИспользоватьWS Тогда
					
					ПроверяемыеРеквизиты.Добавить("ПутьКWebСервису");
					ПроверяемыеРеквизиты.Добавить("ИмяWebСервиса");
					ПроверяемыеРеквизиты.Добавить("ТочкаПодключенияWebСервиса");
					
				Иначе			
					
					ПроверяемыеРеквизиты.Добавить("РазмещениеВнешнейИБ");
				
					Если РазмещениеВнешнейИБ <> Перечисления.ВидыРазмещенияИБ.КлиентСерверный
					 ИЛИ ТипБД.ВерсияПлатформы = Перечисления.ПлатформыВнешнихИнформационныхБаз.Предприятие77 Тогда
						ПроверяемыеРеквизиты.Добавить("КаталогИБ");
					Иначе
						ПроверяемыеРеквизиты.Добавить("ИмяСервера");
						ПроверяемыеРеквизиты.Добавить("ИмяИБНаСервере");
					КонецЕсли;

				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
